{"case_number":"B2022-16584","date_on_document":"02/08/2022","document_type":"Analysis Report","summary":"This document is a DNA analysis report from ABC Forensic Services Laboratory for the Bramblewood County Sheriff's Office. It details the DNA analysis performed on various items of evidence, including a Glock pistol, masks, and a towel, and compares DNA profiles obtained from these items with reference samples from several individuals. The report concludes with the inclusion and exclusion of certain individuals as possible contributors to the DNA profiles found on the evidence.","conclusion":"Kathy Poindexter is included as a possible contributor to the DNA profile obtained from the Glock firearm, towel, and mask, while Gerald Gillespie is included as a possible contributor to a mixture DNA profile from the towel. Other individuals are excluded as contributors to these profiles.","location":[],"people":[{"name":"Gerald Gillespie","address":null,"relevance":"Reference sample, possible contributor to mixture DNA profile"},{"name":"Kathy Poindexter","address":null,"relevance":"Reference sample, possible contributor to DNA profile"},{"name":"Brad Baker","address":null,"relevance":"Reference sample, excluded as contributor"},{"name":"Janet Jones","address":null,"relevance":"Reference sample, excluded as contributor"},{"name":"Samantha Webster","address":null,"relevance":"Reference sample, excluded as contributor"}],"events":[],"evidence":[{"item_number":"BCSO-3","description":["Black Glock 17 pistol, 9x19 mm caliber, swabs of grip and trigger matched a single-source male DNA profile."]},{"item_number":"BCSO-3.2","description":["Swabs of reddish-brown stains from muzzle matched a DNA profile including Kathy Poindexter."]},{"item_number":"BCSO-5","description":["Small white towel with reddish-brown stains, cutting matched a DNA profile including Kathy Poindexter."]},{"item_number":"BCSO-5.2","description":["Swabs of towel center yielded a mixture DNA profile including Gerald Gillespie."]},{"item_number":"BCSO-6","description":["Black Halloween-type mask with white eye rings, swabs of mouth region matched a single-source male DNA profile."]},{"item_number":"BCSO-6.2","description":["Cutting of reddish-brown stain on mask matched a DNA profile including Kathy Poindexter."]},{"item_number":"BCSO-7.1","description":["Swabs of mouth region of mask with purple eye rings matched a single-source male DNA profile."]},{"item_number":"BCSO-9.1","description":["Cutting of buccal swab from Gerald Gillespie, DNA profile obtained."]},{"item_number":"CW-1.2","description":["Cutting of blood card from Kathy Poindexter, DNA profile obtained."]},{"item_number":"CW-13.2","description":["Cutting of buccal swab from Brad Baker, DNA profile obtained."]},{"item_number":"CW-14.2","description":["Cutting of buccal swab from Janet Jones, DNA profile obtained."]},{"item_number":"CW-15.2","description":["Cutting of buccal swab from Samantha Webster, DNA profile obtained."]}]}