{"case_number":"B2002-17654","date_on_document":"26/10/2002","document_type":"Crime Scene – Supplemental Report","summary":"The document details the investigation of an armed robbery and homicide at Green Pearl Vintage Gifts on October 25, 2002. Kathy Poindexter was found dead from gunshot wounds, and several items were stolen from the store. Evidence was collected and analyzed, including DNA, fingerprints, and ballistic evidence.","conclusion":"The investigation confirmed the homicide of Kathy Poindexter and identified stolen items from the store. DNA and fingerprint analyses provided profiles consistent with known individuals, and ballistic evidence linked cartridge cases to the same firearm.","location":["Green Pearl Vintage Gifts, 23 Rose Street","2360 Yucca Road","11 Pinnacle Point"],"people":[{"name":"Kathy Poindexter","address":"2360 Yucca Road","relevance":"Victim"},{"name":"Brad Baker","address":"11 Pinnacle Point","relevance":"Complainant and friend/ex-boyfriend of victim"},{"name":"Janet Jones","address":null,"relevance":"Owner of Green Pearl Vintage Gifts"},{"name":"Samantha Webster","address":null,"relevance":"Employee of Green Pearl Vintage Gifts"},{"name":"Detective Colin Williams","address":null,"relevance":"Responding Officer"},{"name":"Sandra Zoro","address":null,"relevance":"Forensic Pathologist"}],"events":[{"event_type":"Incident","details":"Armed robbery and homicide at Green Pearl Vintage Gifts.","time_of_event":"25/10/2002"},{"event_type":"Death","details":"Kathy Poindexter was found dead from gunshot wounds.","time_of_event":"25/10/2002 21:40"},{"event_type":"Investigation","details":"Detective Colin Williams arrived at the scene and collected evidence.","time_of_event":"25/10/2002 22:31"},{"event_type":"Autopsy","details":"Autopsy conducted on Kathy Poindexter confirming gunshot wounds to the head as cause of death.","time_of_event":"26/10/2002 08:07"}],"evidence":[{"item_number":"CW-1","description":["Blood card from Kathy Poindexter (DOB: 08/13/1981)"]},{"item_number":"CW-2A","description":["Swab for possible DNA collected from left CCTV control button in back office","DNA profile generated (mixture). Major contributor: Kathy Poindexter, Minor contributor: Janet Jones."]},{"item_number":"CW-2B","description":["Swab for possible DNA collected from right CCTV control button in back office","DNA profile generated (mixture). Major contributor: Kathy Poindexter, Minor contributor: Samantha Webster."]},{"item_number":"CW-3","description":["Swab for possible DNA collected from mouth region of drink glass on desk in back office","Consistent with profile of Kathy Poindexter."]},{"item_number":"CW-4","description":["Swab for possible DNA collected from mouth region of juice bottle on floor in back office","Consistent with profile of Samantha Webster."]},{"item_number":"CW-5","description":["Latent lift from drink glass on desk in back office","Identified to right index finger of Kathy Poindexter."]},{"item_number":"CW-6","description":["Latent lift from juice bottle on floor in back office","No latent prints of value for comparison were recovered."]},{"item_number":"CW-7A","description":["Latent lift from broken glass in display case frame in showroom","Identified to right ring finger of Kathy Poindexter."]},{"item_number":"CW-7B","description":["Latent lift from broken glass from display case on floor in showroom","Identified to left middle finger of Brad Baker."]},{"item_number":"CW-8A","description":["Fired bronze and silver in color cartridge case (headstamp: 9mm Luger), collected from floor near decedent","No DNA profiles generated."]},{"item_number":"CW-8B","description":["Fired bronze and silver in color cartridge case (headstamp: 9mm Luger), collected from floor near decedent","No DNA profiles generated."]},{"item_number":"CW-9","description":["CCTV tape recording from back office of Green Pearl Vintage Gifts, 23 Rose Street","Footage shows individuals entering and exiting the store."]},{"item_number":"CW-17","description":["(2) Projectiles collected from Kathy Poindexter (DOB: 08/13/1981) at autopsy","The caliber class of the projectiles was determined to be 9mm."]}]}