{"case_number":"B2002-17654","document_type":"Crime Scene – Supplemental Report","summary":"The document details the investigation of an armed robbery and homicide at Green Pearl Vintage Gifts, where Kathy Poindexter was found dead. Evidence collected includes DNA swabs, latent prints, and fired cartridge cases. Initial witness statements and forensic analysis provide insights into the crime scene and potential suspects.","conclusion":"The investigation indicates that Kathy Poindexter was killed by gunshot wounds to the head during a robbery, with evidence suggesting involvement of known individuals.","location":["Green Pearl Vintage Gifts, 23 Rose Street"],"people":[{"name":"Kathy Poindexter","address":"2360 Yucca Road","relevance":"Victim"},{"name":"Brad Baker","address":"11 Pinnacle Point","relevance":"Complainant, friend/ex-boyfriend of victim"},{"name":"Janet Jones","address":null,"relevance":"Owner of Green Pearl Vintage Gifts"},{"name":"Samantha Webster","address":null,"relevance":"Employee of Green Pearl Vintage Gifts"},{"name":"Detective Colin Williams","address":null,"relevance":"Responding officer"},{"name":"Sandra Zoro","address":null,"relevance":"Forensic Pathologist"}],"events":[{"event_type":"Incident","details":"On October 25, 2002, Kathy Poindexter was found dead at Green Pearl Vintage Gifts, suspected to be a victim of armed robbery and homicide."},{"event_type":"Investigation","details":"Detective Colin Williams arrived at the scene, collected evidence, and took witness statements from Janet Jones, Samantha Webster, and Brad Baker."},{"event_type":"Autopsy","details":"Conducted by Sandra Zoro, confirming cause of death as gunshot wounds to the head."}],"evidence":[{"item_number":"CW-1","description":["Blood card from Kathy Poindexter, DNA profile generated."]},{"item_number":"CW-2A","description":["Swab from left CCTV control button, DNA profile generated, major contributor Kathy Poindexter, minor contributor Janet Jones."]},{"item_number":"CW-2B","description":["Swab from right CCTV control button, DNA profile generated, major contributor Kathy Poindexter, minor contributor Samantha Webster."]},{"item_number":"CW-3","description":["Swab from drink glass, DNA consistent with Kathy Poindexter."]},{"item_number":"CW-4","description":["Swab from juice bottle, DNA consistent with Samantha Webster."]},{"item_number":"CW-5","description":["Latent print from drink glass, identified to Kathy Poindexter."]},{"item_number":"CW-6","description":["No latent prints of value from juice bottle."]},{"item_number":"CW-7A","description":["Latent print from broken glass in display case, identified to Kathy Poindexter."]},{"item_number":"CW-7B","description":["Latent print from broken glass on floor, identified to Brad Baker."]},{"item_number":"CW-8A","description":["Fired cartridge case, no DNA, fired by same firearm as CW-8B."]},{"item_number":"CW-8B","description":["Fired cartridge case, no DNA, fired by same firearm as CW-8A."]},{"item_number":"CW-9","description":["CCTV tape recording, shows individuals entering and exiting the store."]},{"item_number":"CW-17","description":["Projectiles collected from Kathy Poindexter, caliber class 9mm."]},{"item_number":"CW-18","description":["Fingernail scrapings from Kathy Poindexter, DNA consistent with her profile."]}]}