{"case_number":"B2002-17654","date_on_document":"07/07/2022","document_type":"Investigative Report","summary":"Detective April Marshall investigates a cold case involving an armed robbery and homicide from 2002 after a Glock 17 pistol was found and linked to the case. The investigation leads to Gerald Gillespie, whose property was near the location where the gun was found, and a pocket watch matching a stolen item from the crime scene is discovered in his home. Buccal swabs and fingerprint standards were collected from Mr. Gillespie for forensic analysis.","conclusion":"The investigation has linked a firearm found in 2022 to the 2002 cold case, and a pocket watch matching a stolen item from the crime scene was found in Gerald Gillespie's home. Forensic samples were collected for further analysis.","location":["Green Pearl Vintage Gifts, 23 Rose Street","620 Mason Street, Shady Brush neighborhood","225 Evans Road"],"people":[{"name":"Kathy Poindexter","address":"2360 Yucca Road","relevance":"Victim"},{"name":"Carrie Fitz","address":null,"relevance":"Investigator"},{"name":"April Marshall","address":null,"relevance":"Detective"},{"name":"Gerald Gillespie","address":"225 Evans Road","relevance":"Property owner where evidence was found"},{"name":"Ryan Gillespie","address":null,"relevance":"Gerald Gillespie's brother"},{"name":"Rita Gillespie","address":null,"relevance":"Gerald Gillespie's aunt"}],"events":[{"event_type":"Incident","details":"Armed robbery and homicide at Green Pearl Vintage Gifts.","time_of_event":"25/10/2002"},{"event_type":"Discovery of Evidence","details":"A Glock 17 pistol was found at 620 Mason Street and linked to the cold case via NIBIN.","time_of_event":"01/07/2022"},{"event_type":"Interview","details":"Detective Marshall interviewed Gerald Gillespie and observed a pocket watch matching a stolen item from the crime scene.","time_of_event":"07/07/2022"}],"evidence":[{"item_number":"BCSO-8","description":["Known fingerprint standards bearing the name Gerald Gillespie (DOB: 01/17/1967)"]},{"item_number":"BCSO-9","description":["Buccal swab standard collected from Gerald Gillespie (DOB: 01/17/1967)"]},{"item_number":"CW-8A","description":["Fired bronze and silver in color cartridge case (headstamp: 9mm Luger), collected from floor near decedent"]}]}