{"case_number":"B2002-17654","date_on_document":"07/07/2022","document_type":"Investigative Report","summary":"The report details the discovery of a Glock 17 pistol linked to a 2002 cold case involving armed robbery and homicide. Detective April Marshall investigates the connection between the firearm and the case, interviewing Gerald Gillespie, whose property was near the location where the gun was found. A pocket watch matching the description of a stolen item from the incident was also observed at Gillespie's home.","conclusion":"The investigation is ongoing with forensic analysis of the firearm and potential links to the cold case. Gerald Gillespie provided DNA and fingerprint samples for elimination purposes.","location":["Green Pearl Vintage Gifts, 23 Rose Street","620 Mason Street, Shady Brush neighborhood","225 Evans Road"],"people":[{"name":"Kathy Poindexter","address":"2360 Yucca Road","relevance":"Victim"},{"name":"Carrie Fitz","address":null,"relevance":"Investigator"},{"name":"April Marshall","address":null,"relevance":"Detective"},{"name":"Gerald Gillespie","address":"225 Evans Road","relevance":"Property owner, interviewed"},{"name":"Ryan Gillespie","address":null,"relevance":"Gerald Gillespie's brother, lived at 225 Evans Road between 2001 and 2003"},{"name":"Rita Gillespie","address":null,"relevance":"Gerald Gillespie's aunt, lived at 225 Evans Road in 2010"}],"events":[{"event_type":"Discovery of firearm","details":"A Glock 17 pistol was found by homeowners at 620 Mason Street, potentially linked to a cold case via a NIBIN hit.","time_of_event":"01/07/2022"},{"event_type":"Interview with Gerald Gillespie","details":"Detective Marshall interviewed Gerald Gillespie regarding the firearm and observed a pocket watch matching a stolen item from the 2002 incident.","time_of_event":"07/07/2022"}],"evidence":[{"item_number":"BCSO-8","description":["Known fingerprint standards bearing the name Gerald Gillespie (DOB: 01/17/1967)"]},{"item_number":"BCSO-9","description":["Buccal swab standard collected from Gerald Gillespie (DOB: 01/17/1967)"]},{"item_number":"CW-8A","description":["Fired bronze and silver in color cartridge case (headstamp: 9mm Luger), collected from floor near decedent"]}]}