{"case_number":"B2002-17654","date_on_document":"03/11/2005","document_type":"Analysis Report","summary":"This document is a comprehensive analysis report of the cold case involving the armed robbery and homicide of Kathy Poindexter at Green Pearl Vintage Gifts on October 25, 2002. It includes detailed forensic results from DNA, latent prints, digital evidence, and firearms analysis. The report summarizes the findings of the initial investigation and the subsequent laboratory analysis conducted by the Cold Case Division.","conclusion":"The forensic analysis identified DNA profiles and latent prints that link individuals to the crime scene. The firearm analysis confirmed that the same weapon was used for both cartridge cases found at the scene. The CCTV footage provided a timeline of events leading up to the incident.","location":["Green Pearl Vintage Gifts, 23 Rose Street"],"people":[{"name":"Kathy Poindexter","address":"2360 Yucca Road","relevance":"Victim"},{"name":"Brad Baker","address":"11 Pinnacle Point","relevance":"Complainant and friend/ex-boyfriend of the victim"},{"name":"Janet Jones","address":null,"relevance":"Owner of Green Pearl Vintage Gifts"},{"name":"Samantha Webster","address":null,"relevance":"Employee of Green Pearl Vintage Gifts"}],"events":[{"event_type":"Incident","details":"Armed robbery and homicide at Green Pearl Vintage Gifts.","time_of_event":"25/10/2002"}],"evidence":[{"item_number":"CW-1","description":["Blood card from Kathy Poindexter, DNA profile generated."]},{"item_number":"CW-2A","description":["Swab for possible DNA from left CCTV control button, major contributor profile consistent with Kathy Poindexter, minor with Janet Jones."]},{"item_number":"CW-2B","description":["Swab for possible DNA from right CCTV control button, major contributor profile consistent with Kathy Poindexter, minor with Samantha Webster."]},{"item_number":"CW-3","description":["Swab for possible DNA from drink glass, consistent with Kathy Poindexter."]},{"item_number":"CW-4","description":["Swab for possible DNA from juice bottle, consistent with Samantha Webster."]},{"item_number":"CW-5","description":["Latent lift from drink glass, identified to Kathy Poindexter."]},{"item_number":"CW-7A","description":["Latent lift from broken glass in display case, identified to Kathy Poindexter."]},{"item_number":"CW-7B","description":["Latent lift from broken glass in display case, identified to Brad Baker."]},{"item_number":"CW-8A","description":["Fired cartridge case, no DNA profiles generated, suitable for firearms comparison."]},{"item_number":"CW-8B","description":["Fired cartridge case, no DNA profiles generated, suitable for firearms comparison."]},{"item_number":"CW-9","description":["CCTV tape recording, shows timeline of events leading up to the incident."]},{"item_number":"CW-17","description":["Projectiles collected from Kathy Poindexter, caliber class determined to be 9mm."]}]}